notes/notes.org
#+title: Karachentsev List notes
#+startup: latexpreview
#+bibliography: "../My Library/My Library.bib"
#+PROPERTY: header-args :lang python :eval python :exports results :tangle final.py :results output drawer :session main

This list contains measurements from the galaxies in the Local Cosmological Volume (LCV), and the last update of data is on <2023-11-22 Wed>. I downloaded the database from [cite:@karachentsevUPDATEDNEARBYGALAXY2013]


Because I have to download each tables seperately from the site, I use this script



#+begin_src sh :results none

cd ~/Documents/Research_paper_SFR/
wget --no-check-certificate -r -nH --cut-dirs=2 --accept="*.dat" --reject="*8.dat" -e robots=off -U mozilla https://www.sao.ru/lv/lvgdb/tables/

#+end_src



Let's break down the wget command and its various options:

+ --no-check-certificate: This option tells wget to not check SSL certificates. It's useful when dealing with websites that have self-signed or expired SSL certificates.

+ -r or --recursive: This option enables recursive downloading. It means that wget will follow links and download files from the specified URL as well as its subdirectories.

+ -nH or --no-host-directories: This option disables the creation of host directories. Without this option, wget would create a directory structure based on the hostname of the server.

+ --cut-dirs=2: This option instructs wget to ignore the first two directory components when creating the local directory structure. In this case, it helps to avoid creating unnecessary parent directories based on the server's directory structure.

+ --accept="*.dat": This option specifies the file types to accept during the download. In this case, only files with the extension ".dat" will be downloaded.

+ --reject="*8.dat": This option specifies the file types to reject during the download. Files with names containing "8.dat" will be excluded from the download.

+ -e robots=off: This option tells wget to ignore the robots.txt file, which is a file used by websites to communicate with web crawling and scraping bots about which parts of the site should not be crawled.

+ -U mozilla: This option sets the User-Agent header to "mozilla". The User-Agent header is used by the browser to identify itself to the server. In this case, it's set to mimic a Mozilla browser.

Finally, the URL https://www.sao.ru/lv/lvgdb/tables/ is the starting point for the recursive download.


* Original data set

The data I will use for this project come from the Karachentsev  catalog (2022-12-02), which is an updated version of the list used in Kroupa et al. 2020
From the list I use the tables "Catalog of Nearby Galaxies", "Global Parameters of the Nearby Galaxies" and "List of the nearby galaxies with measured SFR"

#+begin_src python

import numpy as np
from astropy.io import ascii
from astropy.coordinates import SkyCoord, ICRS, Galactic, FK4, FK5, Angle
from astropy.table import Table, QTable, join, hstack, vstack, unique, Column, MaskedColumn, setdiff
from astropy.utils.masked import Masked
from astropy.time import Time
import astropy.units as u
from astropy.utils.diff import report_diff_values
import glob as glob
import sys

file_pattern = "../tables/lvg_table*.dat"

# Use glob to find all matching files
file_paths = sorted(glob.glob(file_pattern))

dq = []  # Create an empty list to store Tables

for file_path in file_paths:
    table = Table(ascii.read(file_path, format="mrt"),masked=True)
    dq.append(table)
#+end_src

#+RESULTS:
:results:
:end:


#+begin_src python

nm = []
nm = ["cat", "param", "magn", "vel", "kin", "dist", "sfr"]

# Automatically associate the names with the Tables
for i in range(len(nm)):
    globals()[nm[i]] = dq[i]
#+end_src

#+RESULTS:
:results:
:end:

** Table 3

I will need the colors, so i think the best way is to create tables for each filter and then join them. I also delete the column r_mag = Reference for mag observation

#+begin_src python :results value

magn.remove_column("r_mag")

filters = magn.group_by("Filter")

keys = filters.groups.keys["Filter"]
indices = filters.groups.indices


magn_table = Table()
dcolor = []
pain = 0
n = 0
print(indices,"\n", keys,"\n")
for ind in indices[1:]:
    magn_table = filters[pain:ind]
    magn_table.rename_column("l_mag", f"l_mag_{keys[n]}")
    magn_table.rename_column("mag", f"mag_{keys[n]}")
    magn_table.rename_column("e_mag", f"e_mag_{keys[n]}")
    magn_table.remove_column("Filter")
    print("\n********************",keys[n],"********************\n",magn_table.info, )
    pain = ind
    n+=1
    dcolor.append(magn_table)
colors = Table(dcolor[0])

for dcolor_item in dcolor[1:]:
    colors = Table(join(colors, dcolor_item, keys="Name", join_type="outer"))

colors.info
#+end_src

#+RESULTS:
:results:
<Table length=1441>
   name    dtype  unit            description             n_bad
--------- ------- ---- ---------------------------------- -----
     Name   str18      Galaxy name in well-known catalogs     0
  l_mag_B    str1                       Limit flag on mag  1441
    mag_B float64  mag   Apparent magnitude in Filter (1)     9
  e_mag_B float64  mag                   Error in mag (2)  1251
 l_mag_FU    str1                       Limit flag on mag  1441
   mag_FU float64  mag   Apparent magnitude in Filter (1)  1440
 e_mag_FU float64  mag                   Error in mag (2)  1441
l_mag_FUV    str1                       Limit flag on mag  1107
  mag_FUV float64  mag   Apparent magnitude in Filter (1)   314
e_mag_FUV float64  mag                   Error in mag (2)   737
 l_mag_HI    str1                       Limit flag on mag  1231
   mag_HI float64  mag   Apparent magnitude in Filter (1)   496
 e_mag_HI float64  mag                   Error in mag (2)  1293
 l_mag_Ha    str1                       Limit flag on mag  1311
   mag_Ha float64  mag   Apparent magnitude in Filter (1)   705
 e_mag_Ha float64  mag                   Error in mag (2)   767
 l_mag_Ks    str1                       Limit flag on mag  1441
   mag_Ks float64  mag   Apparent magnitude in Filter (1)  1081
 e_mag_Ks float64  mag                   Error in mag (2)  1095
:end:


** Merging the tables

*** Fixing the conflicts

**** A26 and AB
#+begin_src python
param.rename_column("a26", "A26")
param.rename_column("AB","AB_int")
#+end_src

#+RESULTS:
:results:
:end:

