notes/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-22 Wed 20:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Karachentsev List notes</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Karachentsev List notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org50fd114">1. Original data set</a>
<ul>
<li><a href="#org3d2399e">1.1. Table 3</a></li>
<li><a href="#orge62a0c6">1.2. Merging the tables</a>
<ul>
<li><a href="#orgf2a6864">1.2.1. Fixing the conflicts</a></li>
<li><a href="#org18afe3f">1.2.2. Merging</a></li>
</ul>
</li>
<li><a href="#org41ea03b">1.3. <span class="todo IDEA">IDEA</span> mapping with Color, type of galaxy, SFR, Velocity</a></li>
<li><a href="#org15cbd04">1.4. <span class="todo IDEA">IDEA</span> machine learning</a>
<ul>
<li><a href="#org6bdf1dd">1.4.1. Bands (FUV)</a></li>
<li><a href="#org6ed29f0">1.4.2. missing SFR</a></li>
</ul>
</li>
<li><a href="#org657c943">1.5. <span class="todo ___">[?]</span> What is the W50 velocity</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This list contains measurements from the galaxies in the Local Cosmological Volume (LCV), and the last update of data is on &lt;%t&gt; 2023-11-14. I downloaded the database from (Karachentsev, Makarov, and Kaisina 2013)
</p>

<p>
Because I have to download each tables seperately from the site, I use this script
</p>



<p>
<code>wget --no-check-certificate -r -nH --cut-dirs=2 --accept="*.dat" --reject="*8.dat" -e robots=off -U mozilla https://www.sao.ru/lv/lvgdb/tables/</code>
</p>

<p>
Let&rsquo;s break down the wget command and its various options:
</p>

<ul class="org-ul">
<li>&#x2013;no-check-certificate: This option tells wget to not check SSL certificates. It&rsquo;s useful when dealing with websites that have self-signed or expired SSL certificates.</li>

<li>-r or &#x2013;recursive: This option enables recursive downloading. It means that wget will follow links and download files from the specified URL as well as its subdirectories.</li>

<li>-nH or &#x2013;no-host-directories: This option disables the creation of host directories. Without this option, wget would create a directory structure based on the hostname of the server.</li>

<li>&#x2013;cut-dirs=2: This option instructs wget to ignore the first two directory components when creating the local directory structure. In this case, it helps to avoid creating unnecessary parent directories based on the server&rsquo;s directory structure.</li>

<li>&#x2013;accept=&ldquo;*.dat&rdquo;: This option specifies the file types to accept during the download. In this case, only files with the extension &ldquo;.dat&rdquo; will be downloaded.</li>

<li>&#x2013;reject=&ldquo;*8.dat&rdquo;: This option specifies the file types to reject during the download. Files with names containing &ldquo;8.dat&rdquo; will be excluded from the download.</li>

<li>-e robots=off: This option tells wget to ignore the robots.txt file, which is a file used by websites to communicate with web crawling and scraping bots about which parts of the site should not be crawled.</li>

<li>-U mozilla: This option sets the User-Agent header to &ldquo;mozilla&rdquo;. The User-Agent header is used by the browser to identify itself to the server. In this case, it&rsquo;s set to mimic a Mozilla browser.</li>
</ul>

<p>
Finally, the URL <a href="https://www.sao.ru/lv/lvgdb/tables/">https://www.sao.ru/lv/lvgdb/tables/</a> is the starting point for the recursive download.
</p>
<div id="outline-container-org50fd114" class="outline-2">
<h2 id="org50fd114"><span class="section-number-2">1.</span> Original data set</h2>
<div class="outline-text-2" id="text-1">
<p>
The data I will use for this project come from the Karachentsev  catalog (2022-12-02), which is an updated version of the list used in Kroupa et al. 2020
From the list I use the tables &ldquo;Catalog of Nearby Galaxies&rdquo;, &ldquo;Global Parameters of the Nearby Galaxies&rdquo; and &ldquo;List of the nearby galaxies with measured SFR&rdquo;
</p>
</div>
<div id="outline-container-org3d2399e" class="outline-3">
<h3 id="org3d2399e"><span class="section-number-3">1.1.</span> Table 3</h3>
<div class="outline-text-3" id="text-1-1">
<p>
I will need the colors, so i think the best way is to create tables for each filter and then join them. I also delete the column r<sub>mag</sub> = Reference for mag observation
</p>

<p>
&lt;Table length=1441&gt;
   name    dtype  unit            description             n<sub>bad</sub>
----&#x2013;&#x2014; --&#x2013;&#x2014; -&#x2014; -----------------------------&#x2013;&#x2014; &#x2013;&#x2014;
     Name   str18      Galaxy name in well-known catalogs     0
  l<sub>mag</sub><sub>B</sub>    str1                       Limit flag on mag  1441
    mag<sub>B</sub> float64  mag   Apparent magnitude in Filter (1)     9
  e<sub>mag</sub><sub>B</sub> float64  mag                   Error in mag (2)  1251
 l<sub>mag</sub><sub>FU</sub>    str1                       Limit flag on mag  1441
   mag<sub>FU</sub> float64  mag   Apparent magnitude in Filter (1)  1440
 e<sub>mag</sub><sub>FU</sub> float64  mag                   Error in mag (2)  1441
l<sub>mag</sub><sub>FUV</sub>    str1                       Limit flag on mag  1107
  mag<sub>FUV</sub> float64  mag   Apparent magnitude in Filter (1)   314
e<sub>mag</sub><sub>FUV</sub> float64  mag                   Error in mag (2)   737
 l<sub>mag</sub><sub>HI</sub>    str1                       Limit flag on mag  1231
   mag<sub>HI</sub> float64  mag   Apparent magnitude in Filter (1)   496
 e<sub>mag</sub><sub>HI</sub> float64  mag                   Error in mag (2)  1293
 l<sub>mag</sub><sub>Ha</sub>    str1                       Limit flag on mag  1311
   mag<sub>Ha</sub> float64  mag   Apparent magnitude in Filter (1)   705
 e<sub>mag</sub><sub>Ha</sub> float64  mag                   Error in mag (2)   767
 l<sub>mag</sub><sub>Ks</sub>    str1                       Limit flag on mag  1441
   mag<sub>Ks</sub> float64  mag   Apparent magnitude in Filter (1)  1081
 e<sub>mag</sub><sub>Ks</sub> float64  mag                   Error in mag (2)  1095
</p>
</div>
</div>
<div id="outline-container-orge62a0c6" class="outline-3">
<h3 id="orge62a0c6"><span class="section-number-3">1.2.</span> Merging the tables</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgf2a6864" class="outline-4">
<h4 id="orgf2a6864"><span class="section-number-4">1.2.1.</span> Fixing the conflicts</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
