notes/notes.org
**** W50
#+begin_src python

identical = report_diff_values(cat["Name","W50"], kin["Name", "W50"])
print(identical)
#+end_src

#+RESULTS:
:results:
  a>    Name     W50
  b>      Name      W50
   ? ++            +
  a>            km / s
  b>               km / s
   ? +++
  a> ---------- ------
  b> ------------- ------
   ?           +++
  a>  AGC102728     21
  b>     AGC102728     21
   ? +++
  a>   UGC12894     34
  b>      UGC12894     34
   ? +++
  a>  PGC000083     32
  b>     PGC000083     32
   ? +++
  a>        WLM     53
  b>           WLM     53
   ? +++
  a>  And XVIII     23
  b>     And XVIII     23
   ? +++
  a>  PAndAS-03     --
  a>  PAndAS-04     --
  a>  PAndAS-05     --
  a> ESO409-015     53
  b>    ESO409-015     53
   ? +++
  a>  AGC748778     16
  b>     AGC748778     16
   ? +++
  a>     And XX     17
  b>        And XX     17
   ? +++
  a>   UGC00064     60
  b>      UGC00064     60
   ? +++
  a> ESO349-031     30
  b>    ESO349-031     30
   ? +++
  a>  dw0009-25     --
  b>       NGC0024    213
  b>       NGC0045    172
  b>       PiscesA     22
  b>       NGC0055    169
  a>        ...    ...
  b>           ...    ...
   ? +++
  b>        DDO217    117
  b>        IC5332    102
  b> LV J2335-3713     29
  b>       NGC7713    182
  a>   UGC12713     95
  b>      UGC12713     95
   ? +++
  a>  Phoenix 2     --
  a>  PGC680341     48
  b>     PGC680341     48
   ? +++
  a>    UGCA442     94
  b>       UGCA442     94
   ? +++
  a>      KKH98     21
  b>         KKH98     21
   ? +++
  a> ESO348-009     85
  b>    ESO348-009     85
   ? +++
  a>   Peg dSph     22
  b>      Peg dSph     22
   ? +++
  a> ESO149-003     39
  b>    ESO149-003     39
   ? +++
  a>    And XXI     17
  b>       And XXI     17
   ? +++
  a> Tucana III      4
  b>    Tucana III      4
   ? +++
  a>  PAndAS-01     --
  a>    NGC7793    172
  b>       NGC7793    172
   ? +++
  a>  PAndAS-02     --
  a>  PGC704814     --
  a>   And XXIX     13
  b>      And XXIX     13
   ? +++
  a> Length = 1441 rows
   ?           ^^^
  b> Length = 816 rows
   ?          + ^
False
:end:

But, according to the metadata of table 1 "Note (9): The main source of W50 data was LEDA, as well as the HIPASS and ALFALFA surveys. The references to individual W50 measurements are presented in Table 5 and the LV database"

So I can drop the column of table 1 and only keep the table 5 W50

#+begin_src python
cat.remove_column("W50")
kin.remove_column("r_W50")
#+end_src

#+RESULTS:
:results:
:end:

**** BMag

The BMags of Table 2 and Table 7 have some differences (in the version of 14/11/2023).
+ The SFR(BMag) has less values than CAT(BMag)
+ The SFR(BMag) has better precision (.01)

#+begin_src python
# Open a file for writing
with open('diff_report.txt', 'w') as file:
    # Redirect the output to the file
   identical = report_diff_values(param["Name","BMag"], sfr["Name", "BMag"], rtol=0.7, atol=0.7, fileobj=file)
print(identical)
#+end_src

#+RESULTS:
:results:
False
:end:

To keep all the values and the high precision, I will join the tables so the SFR_B will have masked values for the missing galaxies, and then I will replace the masks with the values of CAT_B

#+begin_src python
bmag = join(param["Name","BMag"], sfr["Name","BMag"], join_type='outer', keys = "Name")


# Fill missing (masked) values in BMag_2 with corresponding values from BMag_1
for i in range(len(bmag)):
    if bmag["BMag_2"][i].mask == True:
       bmag['BMag_2'][i] = bmag['BMag_1'][i]
bmag.rename_column("BMag_2", "BMag")
bmag.remove_column("BMag_1")

print(bmag["BMag"])

#+end_src

#+RESULTS:
:results:
[0;33mWARNING[0m: MergeConflictWarning: In merged column 'Name' the 'description' attribute does not match (Galaxy name in well-known catalogs != Galaxy name).  Using Galaxy name for merged output [astropy.utils.metadata]
:end:

#+begin_src python

sfr.remove_column("BMag")
param.remove_column("BMag")
sfr = QTable(join(sfr,bmag, join_type = "outer"))

sfr.info()
#+end_src

#+RESULTS:
:results:
<QTable length=1441>
  name    dtype   unit                     description                        class      n_bad
-------- ------- ------ ------------------------------------------------- -------------- -----
    Name   str18                                              Galaxy name   MaskedColumn     0
     RAh float64      h                   Hour of Right Ascension (J2000) MaskedQuantity   182
     RAm float64    min                 Minute of Right Ascension (J2000) MaskedQuantity   182
     RAs float64      s                 Second of Right Ascension (J2000) MaskedQuantity   182
     DE-    str1                          Sign of the Declination (J2000)   MaskedColumn   182
     DEd float64    deg                     Degree of Declination (J2000) MaskedQuantity   182
     DEm float64 arcmin                  Arcminute of Declination (J2000) MaskedQuantity   182
     DEs float64 arcsec                  Arcsecond of Declination (J2000) MaskedQuantity   182
       T   int64                        de Vaucouleurs morphological type   MaskedColumn   183
 l_SFRHa    str1                                      Limit flag on SFRHa   MaskedColumn  1311
   SFRHa float64        H{alpha} derived integral star formation rate (1)   MaskedColumn   705
   l_PHa    str1                                        Limit flag on PHa   MaskedColumn  1311
     PHa float64            H{alpha} derived evolutionary P parameter (1)   MaskedColumn   708
   l_FHa    str1                                        Limit flag on FHa   MaskedColumn  1370
     FHa float64            H{alpha} derived evolutionary F parameter (1)   MaskedColumn   822
l_SFRFUV    str1                                     Limit flag on SFRFUV   MaskedColumn  1107
  SFRFUV float64             FUV derived integral star formation rate (1)   MaskedColumn   313
  l_PFUV    str1                                       Limit flag on PFUV   MaskedColumn  1107
    PFUV float64                 FUV derived evolutionary P parameter (1)   MaskedColumn   314
  l_FFUV    str1                                       Limit flag on FFUV   MaskedColumn  1304
    FFUV float64                 FUV derived evolutionary F parameter (1)   MaskedColumn   668
  BMag_1 float64    mag                     Absolute B band magnitude (4) MaskedQuantity     9
  BMag_2 float64    mag                     Absolute B band magnitude (1) MaskedQuantity   185
:end:

**** Right Ascension

#+begin_src python
with open('diff_report_RAh.txt', 'w') as file:
    # Redirect the output to the file
   identical = report_diff_values(param["Name","RAh"], sfr["Name", "RAh"], fileobj=file)
print(identical)
#+end_src

#+RESULTS:
:results:
False
:end:

As I observe, the Right Ascension of CAT and PARAM are the same and the problem is with the SFR table. Plus, as I see from the file "./diff_report_RAh.txt" the differences are marked as +,  indicating new rows in the table.

So I can drop them in the table SFR.

#+begin_src python
columns_to_remove = ["RAh", "RAm", "RAs", "DE-", "DEd","DEm", "DEs"]
# Remove the identified columns
for col in columns_to_remove:
    sfr.remove_column(col)
#+end_src

#+RESULTS:
:results:
:end:

