notes/notes.html
<li><a id="org12028ee"></a>A26 and AB<br />
<div class="outline-text-5" id="text-1-2-1-1">
</div>
</li>
<li><a id="org0f067b9"></a>W50<br />
<div class="outline-text-5" id="text-1-2-1-2">
<p>
        Name    W50  
               km / s
     ----&#x2013;&#x2014; -&#x2013;&#x2014;
     AGC102728     21
           &#x2026;    &#x2026;
  a&gt; PGC704814     &#x2013;
  b&gt;   NGC7793    172
      And XXIX     13
  a&gt; Length = 1441 rows
   ?           ^^^
  b&gt; Length = 816 rows
   ?          + ^
False
</p>

<p>
But, according to the metadata of table 1 &ldquo;Note (9): The main source of W50 data was LEDA, as well as the HIPASS and ALFALFA surveys. The references to individual W50 measurements are presented in Table 5 and the LV database&rdquo;
</p>

<p>
So I can drop the column of table 1 and only keep the table 5 W50
</p>
</div>
</li>
<li><a id="org03948a9"></a>BMag<br />
<div class="outline-text-5" id="text-1-2-1-3">
<p>
The BMags of Table 2 and Table 7 have some differences (in the version of 14/11/2023).
</p>
<ul class="org-ul">
<li>The SFR(BMag) has less values than CAT(BMag)</li>
<li>The SFR(BMag) has better precision (.01)</li>
</ul>

<p>
False
</p>

<p>
To keep all the values and the high precision, I will join the tables so the SFR<sub>B</sub> will have masked values for the missing galaxies, and then I will replace the masks with the values of CAT<sub>B</sub>
</p>

<p>
[0;33mWARNING[0m: MergeConflictWarning: In merged column &rsquo;Name&rsquo; the &rsquo;description&rsquo; attribute does not match (Galaxy name in well-known catalogs != Galaxy name).  Using Galaxy name for merged output [astropy.utils.metadata]
</p>

<p>
&lt;QTable length=1441&gt;
  name    dtype   unit                     description                        class      n<sub>bad</sub>
---&#x2013;&#x2014; --&#x2013;&#x2014; -&#x2013;&#x2014; --------------------------------------------&#x2013;&#x2014; ---------&#x2013;&#x2014; &#x2013;&#x2014;
    Name   str18                                              Galaxy name   MaskedColumn     0
     RAh float64      h                   Hour of Right Ascension (J2000) MaskedQuantity   182
     RAm float64    min                 Minute of Right Ascension (J2000) MaskedQuantity   182
     RAs float64      s                 Second of Right Ascension (J2000) MaskedQuantity   182
     DE-    str1                          Sign of the Declination (J2000)   MaskedColumn   182
     DEd float64    deg                     Degree of Declination (J2000) MaskedQuantity   182
     DEm float64 arcmin                  Arcminute of Declination (J2000) MaskedQuantity   182
     DEs float64 arcsec                  Arcsecond of Declination (J2000) MaskedQuantity   182
       T   int64                        de Vaucouleurs morphological type   MaskedColumn   183
 l<sub>SFRHa</sub>    str1                                      Limit flag on SFRHa   MaskedColumn  1311
   SFRHa float64        H{alpha} derived integral star formation rate (1)   MaskedColumn   705
   l<sub>PHa</sub>    str1                                        Limit flag on PHa   MaskedColumn  1311
     PHa float64            H{alpha} derived evolutionary P parameter (1)   MaskedColumn   708
   l<sub>FHa</sub>    str1                                        Limit flag on FHa   MaskedColumn  1370
     FHa float64            H{alpha} derived evolutionary F parameter (1)   MaskedColumn   822
l<sub>SFRFUV</sub>    str1                                     Limit flag on SFRFUV   MaskedColumn  1107
  SFRFUV float64             FUV derived integral star formation rate (1)   MaskedColumn   313
  l<sub>PFUV</sub>    str1                                       Limit flag on PFUV   MaskedColumn  1107
    PFUV float64                 FUV derived evolutionary P parameter (1)   MaskedColumn   314
  l<sub>FFUV</sub>    str1                                       Limit flag on FFUV   MaskedColumn  1304
    FFUV float64                 FUV derived evolutionary F parameter (1)   MaskedColumn   668
  BMag<sub>1</sub> float64    mag                     Absolute B band magnitude (4) MaskedQuantity     9
  BMag<sub>2</sub> float64    mag                     Absolute B band magnitude (1) MaskedQuantity   185
</p>
</div>
</li>
<li><a id="org991314a"></a>Right Ascension<br />
<div class="outline-text-5" id="text-1-2-1-4">
<p>
False
</p>

<p>
As I observe, the Right Ascension of CAT and PARAM are the same and the problem is with the SFR table. Plus, as I see from the file &ldquo;./diff<sub>report</sub><sub>RAh.txt</sub>&rdquo; the differences are marked as +,  indicating new rows in the table.
</p>

<p>
So I can drop them in the table SFR.
</p>
</div>
</li>
