notes/notes.org
**** Types

The SFR and CAT tables have the same column, the de Vaucouleurs morphological type.

#+begin_src python

identical = report_diff_values(cat["Name","TType"], sfr["Name", "T"])

#+end_src

#+RESULTS:
:results:
   (Table) a>    Name    TType
  (QTable) b>        Name         T
   (Table) a> ---------- -----
            ?           -
  (QTable) b> ------------------ ---
            ?                +++++++
   (Table) a>  AGC102728    10
   (Table) a>   UGC12894    10
   (Table) a>  PGC000083    10
   (Table) a>        WLM     9
   (Table) a>  And XVIII    -3
   (Table) a>  PAndAS-03    -3
   (Table) a>  PAndAS-04    -3
   (Table) a>  PAndAS-05    -3
   (Table) a> ESO409-015     9
   (Table) a>  AGC748778    10
   (Table) a>     And XX    -3
   (Table) a>   UGC00064    10
   (Table) a> ESO349-031    10
   (Table) a>  dw0009-25    -2
   (Table) a>    NGC0024     5
   (Table) a>        ...   ...
   (Table) a>   UGC12713     7
   (Table) a>  Phoenix 2    -3
   (Table) a>  PGC680341    10
   (Table) a>    UGCA442     8
   (Table) a>      KKH98    10
   (Table) a> ESO348-009    10
   (Table) a>   Peg dSph    -3
   (Table) a> ESO149-003    10
   (Table) a>    And XXI    -3
   (Table) a> Tucana III    -2
   (Table) a>  PAndAS-01    -3
   (Table) a>    NGC7793     6
   (Table) a>  PAndAS-02    -3
   (Table) a>  PGC704814    10
   (Table) a>   And XXIX    -2
  (QTable) b> 6dF J2218489-46130  --
  (QTable) b>           A0554+07  10
  (QTable) b>           A0952+69  10
  (QTable) b>          AGC102728  10
  (QTable) b>          AGC112454   9
  (QTable) b>          AGC112503   9
  (QTable) b>          AGC112521  10
  (QTable) b>          AGC114027  10
  (QTable) b>          AGC122226   9
  (QTable) b>          AGC123352  10
  (QTable) b>          AGC124056  10
  (QTable) b>          AGC124635  10
  (QTable) b>          AGC174585  10
  (QTable) b>          AGC174605  10
  (QTable) b>          AGC181604  10
  (QTable) b>                ... ...
  (QTable) b>        dw1350+5441  -1
  (QTable) b>          dw1355+51  -1
  (QTable) b>          dw1357-28  -1
  (QTable) b>          dw1401-32  -1
  (QTable) b>          dw1403-33  -1
  (QTable) b>          dw1406-29  -1
  (QTable) b>          dw1408+56  10
  (QTable) b>          dw1409-33  -1
  (QTable) b>          dw1410-34  10
  (QTable) b>          dw1412+56  -1
  (QTable) b>          dw1413-34  -1
  (QTable) b>          dw1415-32  10
  (QTable) b>          dw1416+57  -1
  (QTable) b>          dw1446+58  10
  (QTable) b>        dw1907-6342  -1
              Length = 1441 rows
:end:

The problem is that the SFR table is smaller, so it cannot join. I will follow the same steps as in BMag.

#+begin_src python
ttype = Table(join(cat["Name","TType"], sfr["Name","T"], join_type='outer', keys = "Name"))
print(ttype.info)
#+end_src

#+RESULTS:
:results:
[0;33mWARNING[0m: MergeConflictWarning: In merged column 'Name' the 'description' attribute does not match (Galaxy name in well-known catalogs != Galaxy name).  Using Galaxy name for merged output [astropy.utils.metadata]
<Table length=1441>
 name dtype            description            n_bad
----- ----- --------------------------------- -----
 Name str18                       Galaxy name     0
TType int64         Morphology type code (10)     4
    T int64 de Vaucouleurs morphological type   183
:end:

Since each galaxy can have only one  morphological type and as I can see the only difference is that they have is the number of values, I will keep the longer column
#+begin_src python
sfr.remove_column("T")
#+end_src

#+RESULTS:
:results:
:end:

**** Remove References
I have already removed some references. Lets finish it

#+begin_src python
vel.remove_column("r_cz")
dist.remove_column("r_DM")
dist.remove_column("n_DM") # Method used to determine DM

#+end_src

#+RESULTS:
:results:
:end:

