notes/notes.html
<li><a id="orgf3793ff"></a>Types<br />
<div class="outline-text-5" id="text-1-2-1-5">
<p>
The SFR and CAT tables have the same column, the de Vaucouleurs morphological type.
</p>

<p>
 (Table) a&gt;    Name   TType
(QTable) b&gt;        Name         T 
 (Table) a&gt; ----&#x2013;&#x2014; &#x2013;&#x2014;
          ?          -
(QTable) b&gt; -------------&#x2013;&#x2014; &#x2014;
          ?               <del><del><del>++</del></del></del>
 (Table) a&gt; AGC102728    10
 (Table) a&gt;  UGC12894    10
 (Table) a&gt;       &#x2026;   &#x2026;
 (Table) a&gt; PGC704814    10
 (Table) a&gt;  And XXIX    -2
(QTable) b&gt; 6dF J2218489-46130  &#x2013;
(QTable) b&gt;           A0554+07  10
(QTable) b&gt;                &#x2026; &#x2026;
(QTable) b&gt;          dw1446+58  10
(QTable) b&gt;        dw1907-6342  -1
            Length = 1441 rows
</p>

<p>
The problem is that the SFR table is smaller, so it cannot join. I will follow the same steps as in BMag.
</p>

<p>
[0;33mWARNING[0m: MergeConflictWarning: In merged column &rsquo;Name&rsquo; the &rsquo;description&rsquo; attribute does not match (Galaxy name in well-known catalogs != Galaxy name).  Using Galaxy name for merged output [astropy.utils.metadata]
&lt;Table length=1441&gt;
 name dtype            description            n<sub>bad</sub>
&#x2013;&#x2014; &#x2013;&#x2014; ----------------------------&#x2013;&#x2014; &#x2013;&#x2014;
 Name str18                       Galaxy name     0
TType int64         Morphology type code (10)     4
    T int64 de Vaucouleurs morphological type   183
</p>

<p>
Since each galaxy can have only one  morphological type and as I can see the only difference is that they have is the number of values, I will keep the longer column
</p>
</div>
</li>
<li><a id="org10eced2"></a>Remove References<br />
<div class="outline-text-5" id="text-1-2-1-6">
<p>
I have already removed some references. Lets finish it
</p>
</div>
</li>
</ol>
</div>
