notes/notes.org
*** Merging


#+begin_src python
# Find the index of "magn" in the list
index_to_replace = nm.index("magn")

# Replace "magn" with "color"
nm[index_to_replace] = "colors"
#+end_src

#+RESULTS:
:results:
:end:

#+begin_src python
dtables = []


for i in range(len(nm)):
    lists = Table(globals()[nm[i]])
    dtables.append(lists)
#+end_src

#+RESULTS:
:results:
:end:

#+begin_src python

dt = dtables[0]
for data in dtables[1:]:
    dt = Table(join(dt, data, join_type="outer"))
print(dt.info)
#+end_src

#+RESULTS:
:results:
[0;33mWARNING[0m: MergeConflictWarning: In merged column 'Name' the 'description' attribute does not match (Galaxy name in well-known catalogs != Galaxy name).  Using Galaxy name for merged output [astropy.utils.metadata]
<Table length=1441>
   name    dtype       unit                        description                    n_bad
--------- ------- ------------- ------------------------------------------------- -----
     Name   str18                                                     Galaxy name     0
      RAh   int64             h                   Hour of Right Ascension (J2000)     0
      RAm   int64           min                 Minute of Right Ascension (J2000)     0
      RAs float64             s                 Second of Right Ascension (J2000)     0
      DE-    str1                                 Sign of the Declination (J2000)     0
      DEd   int64           deg                     Degree of Declination (J2000)     0
      DEm   int64        arcmin                  Arcminute of Declination (J2000)     0
      DEs   int64        arcsec                  Arcsecond of Declination (J2000)     0
      a26 float64        arcmin                        Major angular diameter (1)    12
      b/a float64                                        Apparent axial ratio (1)    12
       AB float64           mag                 Galactic extinction in B band (2)     1
 l_FUVmag    str1                                            Limit flag on FUVmag  1107
   FUVmag float64           mag                      GALEX FUV band magnitude (3)   313
     Bmag float64           mag                     Integral B band magnitude (4)     9
  l_Hamag    str1                                             Limit flag on Hamag  1311
    Hamag float64           mag     Integral H{alpha} line emission magnitude (5)   705
     Kmag float64           mag                     2MASS K_S_ band magnitude (6)    12
   f_Kmag    str1                                            [*] Flag on Kmag (7)   362
  l_21mag    str1                                             Limit flag on 21mag  1230
    21mag float64           mag                      H I 21 cm line magnitude (8)   496
    TType   int64                                       Morphology type code (10)     4
     Tdw1    str5                                    Dwarf galaxy morphology (11)   233
     Tdw2    str1                 Dwarf galaxy surface brightness morphology (12)   250
     RVel   int64        km / s                 Heliocentric radial velocity (13)   458
      Dis float64           Mpc                                          Distance     0
    f_Dis    str4                             Method flag used to obtain Dis (14)     0
      A26 float64           kpc                         Major linear diameter (1)    12
      inc   int64           deg                                       Inclination    12
       Vm   int64        km / s              Amplitude of rotational velocity (2)   638
   AB_int float64           mag                    Internal B band extinction (3)    12
      SBB float64 mag / arcsec2             Average B band surface brightness (5)    12
  logKLum float64     dex(Lsun)                      Log K_S_ band luminosity (6)    12
   logM26 float64     dex(Msun)               Log mass within Holmberg radius (7)   637
 l_logMHI    str1                                            Limit flag on logMHI  1231
   logMHI float64     dex(Msun)                             Log hydrogen mass (8)   496
      VLG   int64        km / s                               Radial velocity (9)   458
   Theta1 float64                                                Tidal index (10)    81
       MD   str19                                        Main disturber name (11)    81
   Theta5 float64                                        Another tidal index (12)    81
   Thetaj float64      dex(---)                Log K band luminosity density (13)   185
  l_mag_B    str1                                               Limit flag on mag  1441
    mag_B float64           mag                  Apparent magnitude in Filter (1)     9
  e_mag_B float64           mag                                  Error in mag (2)  1251
 l_mag_FU    str1                                               Limit flag on mag  1441
   mag_FU float64           mag                  Apparent magnitude in Filter (1)  1440
 e_mag_FU float64           mag                                  Error in mag (2)  1441
l_mag_FUV    str1                                               Limit flag on mag  1107
  mag_FUV float64           mag                  Apparent magnitude in Filter (1)   314
e_mag_FUV float64           mag                                  Error in mag (2)   737
 l_mag_HI    str1                                               Limit flag on mag  1231
   mag_HI float64           mag                  Apparent magnitude in Filter (1)   496
 e_mag_HI float64           mag                                  Error in mag (2)  1293
 l_mag_Ha    str1                                               Limit flag on mag  1311
   mag_Ha float64           mag                  Apparent magnitude in Filter (1)   705
 e_mag_Ha float64           mag                                  Error in mag (2)   767
 l_mag_Ks    str1                                               Limit flag on mag  1441
   mag_Ks float64           mag                  Apparent magnitude in Filter (1)  1081
 e_mag_Ks float64           mag                                  Error in mag (2)  1095
       cz   int64        km / s                             Heliocentric velocity   458
     e_cz   int64        km / s                                       Error in cz   517
      W50   int64        km / s               Observed HI line width at 50% level   625
    e_W50   int64        km / s                                      Error in W50   894
       DM float64           mag                                  Distance modulus     2
     e_DM float64           mag                                       Error in DM   836
  l_SFRHa    str1                                             Limit flag on SFRHa  1311
    SFRHa float64               H{alpha} derived integral star formation rate (1)   705
    l_PHa    str1                                               Limit flag on PHa  1311
      PHa float64                   H{alpha} derived evolutionary P parameter (1)   708
    l_FHa    str1                                               Limit flag on FHa  1370
      FHa float64                   H{alpha} derived evolutionary F parameter (1)   822
 l_SFRFUV    str1                                            Limit flag on SFRFUV  1107
   SFRFUV float64                    FUV derived integral star formation rate (1)   313
   l_PFUV    str1                                              Limit flag on PFUV  1107
     PFUV float64                        FUV derived evolutionary P parameter (1)   314
   l_FFUV    str1                                              Limit flag on FFUV  1304
     FFUV float64                        FUV derived evolutionary F parameter (1)   668
   BMag_1 float64           mag                     Absolute B band magnitude (4)     9
   BMag_2 float64           mag                     Absolute B band magnitude (1)   185
:end:


#+begin_src python
ascii.write(dt, "../tables/final_table", format= "ecsv" , overwrite=True)
#+end_src

#+RESULTS:
:results:
:end:

#+begin_src python

paint = QTable(ascii.read("../tables/final_table", format="ecsv"),masked=True)

paint.show_in_browser(jsviewer = True)
#+end_src

#+RESULTS:
:results:
[0;33mWARNING[0m: column logKLum has a unit but is kept as a MaskedColumn as an attempt to convert it to Quantity failed with:
UnitTypeError("MaskedQuantity instances require normal units, not <class 'astropy.units.function.logarithmic.DexUnit'> instances.") [astropy.table.table]
[0;33mWARNING[0m: column logM26 has a unit but is kept as a MaskedColumn as an attempt to convert it to Quantity failed with:
UnitTypeError("MaskedQuantity instances require normal units, not <class 'astropy.units.function.logarithmic.DexUnit'> instances.") [astropy.table.table]
[0;33mWARNING[0m: column logMHI has a unit but is kept as a MaskedColumn as an attempt to convert it to Quantity failed with:
UnitTypeError("MaskedQuantity instances require normal units, not <class 'astropy.units.function.logarithmic.DexUnit'> instances.") [astropy.table.table]
:end:

As we can see it works. FINALLY

We use the ~ecsv~ format because I get errors with the ~mrt~.
