notes/notes.html
<div id="outline-container-org18afe3f" class="outline-4">
<h4 id="org18afe3f"><span class="section-number-4">1.2.2.</span> Merging</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
[0;33mWARNING[0m: MergeConflictWarning: In merged column &rsquo;Name&rsquo; the &rsquo;description&rsquo; attribute does not match (Galaxy name in well-known catalogs != Galaxy name).  Using Galaxy name for merged output [astropy.utils.metadata]
&lt;Table length=1441&gt;
   name    dtype       unit                        description                    n<sub>bad</sub>
----&#x2013;&#x2014; --&#x2013;&#x2014; --------&#x2013;&#x2014; --------------------------------------------&#x2013;&#x2014; &#x2013;&#x2014;
     Name   str18                                                     Galaxy name     0
      RAh   int64             h                   Hour of Right Ascension (J2000)     0
      RAm   int64           min                 Minute of Right Ascension (J2000)     0
      RAs float64             s                 Second of Right Ascension (J2000)     0
      DE-    str1                                 Sign of the Declination (J2000)     0
      DEd   int64           deg                     Degree of Declination (J2000)     0
      DEm   int64        arcmin                  Arcminute of Declination (J2000)     0
      DEs   int64        arcsec                  Arcsecond of Declination (J2000)     0
      a26 float64        arcmin                        Major angular diameter (1)    12
      b/a float64                                        Apparent axial ratio (1)    12
       AB float64           mag                 Galactic extinction in B band (2)     1
 l<sub>FUVmag</sub>    str1                                            Limit flag on FUVmag  1107
   FUVmag float64           mag                      GALEX FUV band magnitude (3)   313
     Bmag float64           mag                     Integral B band magnitude (4)     9
  l<sub>Hamag</sub>    str1                                             Limit flag on Hamag  1311
    Hamag float64           mag     Integral H{alpha} line emission magnitude (5)   705
     Kmag float64           mag                     2MASS K<sub>S</sub>_ band magnitude (6)    12
   f<sub>Kmag</sub>    str1                                            [*] Flag on Kmag (7)   362
  l<sub>21mag</sub>    str1                                             Limit flag on 21mag  1230
    21mag float64           mag                      H I 21 cm line magnitude (8)   496
    TType   int64                                       Morphology type code (10)     4
     Tdw1    str5                                    Dwarf galaxy morphology (11)   233
     Tdw2    str1                 Dwarf galaxy surface brightness morphology (12)   250
     RVel   int64        km / s                 Heliocentric radial velocity (13)   458
      Dis float64           Mpc                                          Distance     0
    f<sub>Dis</sub>    str4                             Method flag used to obtain Dis (14)     0
      A26 float64           kpc                         Major linear diameter (1)    12
      inc   int64           deg                                       Inclination    12
       Vm   int64        km / s              Amplitude of rotational velocity (2)   638
   AB<sub>int</sub> float64           mag                    Internal B band extinction (3)    12
      SBB float64 mag / arcsec2             Average B band surface brightness (5)    12
  logKLum float64     dex(Lsun)                      Log K<sub>S</sub>_ band luminosity (6)    12
   logM26 float64     dex(Msun)               Log mass within Holmberg radius (7)   637
 l<sub>logMHI</sub>    str1                                            Limit flag on logMHI  1231
   logMHI float64     dex(Msun)                             Log hydrogen mass (8)   496
      VLG   int64        km / s                               Radial velocity (9)   458
   Theta1 float64                                                Tidal index (10)    81
       MD   str19                                        Main disturber name (11)    81
   Theta5 float64                                        Another tidal index (12)    81
   Thetaj float64      dex(&#x2014;)                Log K band luminosity density (13)   185
  l<sub>mag</sub><sub>B</sub>    str1                                               Limit flag on mag  1441
    mag<sub>B</sub> float64           mag                  Apparent magnitude in Filter (1)     9
  e<sub>mag</sub><sub>B</sub> float64           mag                                  Error in mag (2)  1251
 l<sub>mag</sub><sub>FU</sub>    str1                                               Limit flag on mag  1441
   mag<sub>FU</sub> float64           mag                  Apparent magnitude in Filter (1)  1440
 e<sub>mag</sub><sub>FU</sub> float64           mag                                  Error in mag (2)  1441
l<sub>mag</sub><sub>FUV</sub>    str1                                               Limit flag on mag  1107
  mag<sub>FUV</sub> float64           mag                  Apparent magnitude in Filter (1)   314
e<sub>mag</sub><sub>FUV</sub> float64           mag                                  Error in mag (2)   737
 l<sub>mag</sub><sub>HI</sub>    str1                                               Limit flag on mag  1231
   mag<sub>HI</sub> float64           mag                  Apparent magnitude in Filter (1)   496
 e<sub>mag</sub><sub>HI</sub> float64           mag                                  Error in mag (2)  1293
 l<sub>mag</sub><sub>Ha</sub>    str1                                               Limit flag on mag  1311
   mag<sub>Ha</sub> float64           mag                  Apparent magnitude in Filter (1)   705
 e<sub>mag</sub><sub>Ha</sub> float64           mag                                  Error in mag (2)   767
 l<sub>mag</sub><sub>Ks</sub>    str1                                               Limit flag on mag  1441
   mag<sub>Ks</sub> float64           mag                  Apparent magnitude in Filter (1)  1081
 e<sub>mag</sub><sub>Ks</sub> float64           mag                                  Error in mag (2)  1095
       cz   int64        km / s                             Heliocentric velocity   458
     e<sub>cz</sub>   int64        km / s                                       Error in cz   517
      W50   int64        km / s               Observed HI line width at 50% level   625
    e<sub>W50</sub>   int64        km / s                                      Error in W50   894
       DM float64           mag                                  Distance modulus     2
     e<sub>DM</sub> float64           mag                                       Error in DM   836
  l<sub>SFRHa</sub>    str1                                             Limit flag on SFRHa  1311
    SFRHa float64               H{alpha} derived integral star formation rate (1)   705
    l<sub>PHa</sub>    str1                                               Limit flag on PHa  1311
      PHa float64                   H{alpha} derived evolutionary P parameter (1)   708
    l<sub>FHa</sub>    str1                                               Limit flag on FHa  1370
      FHa float64                   H{alpha} derived evolutionary F parameter (1)   822
 l<sub>SFRFUV</sub>    str1                                            Limit flag on SFRFUV  1107
   SFRFUV float64                    FUV derived integral star formation rate (1)   313
   l<sub>PFUV</sub>    str1                                              Limit flag on PFUV  1107
     PFUV float64                        FUV derived evolutionary P parameter (1)   314
   l<sub>FFUV</sub>    str1                                              Limit flag on FFUV  1304
     FFUV float64                        FUV derived evolutionary F parameter (1)   668
   BMag<sub>1</sub> float64           mag                     Absolute B band magnitude (4)     9
   BMag<sub>2</sub> float64           mag                     Absolute B band magnitude (1)   185
</p>


<p>
[0;33mWARNING[0m: column logKLum has a unit but is kept as a MaskedColumn as an attempt to convert it to Quantity failed with:
UnitTypeError(&ldquo;MaskedQuantity instances require normal units, not &lt;class &lsquo;astropy.units.function.logarithmic.DexUnit&rsquo;&gt; instances.&rdquo;) [astropy.table.table]
[0;33mWARNING[0m: column logM26 has a unit but is kept as a MaskedColumn as an attempt to convert it to Quantity failed with:
UnitTypeError(&ldquo;MaskedQuantity instances require normal units, not &lt;class &lsquo;astropy.units.function.logarithmic.DexUnit&rsquo;&gt; instances.&rdquo;) [astropy.table.table]
[0;33mWARNING[0m: column logMHI has a unit but is kept as a MaskedColumn as an attempt to convert it to Quantity failed with:
UnitTypeError(&ldquo;MaskedQuantity instances require normal units, not &lt;class &lsquo;astropy.units.function.logarithmic.DexUnit&rsquo;&gt; instances.&rdquo;) [astropy.table.table]
</p>

<p>
As we can see it works. FINALLY
</p>

<p>
We use the <code>ecsv</code> format because I get errors with the <code>mrt</code>.
</p>
</div>
</div>
</div>
